src/cf/InformationRegisters/ТрудозатратыПоЗаявкамНаИзменение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ТрудозатратыПоЗаявкамНаИзменение</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Трудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаИзменение</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ЗаявкаНаИзменение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТрудозатратыПоЗаявкамНаИзменение/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Запись.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		Если НЕ ЗначениеЗаполнено(Запись.ЗаявкаНаИзменение) 
			И ЗначениеЗаполнено(Запись.Задача) Тогда
			Запись.ЗаявкаНаИзменение = Запись.Задача.БизнесПроцесс;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
